use UNIVER;

-- гюдюмхе 4

-- цпъгмне времхе
--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе

--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	 
	begin tran 
	insert into PROGRESS values('ад', 1001, '2013-01-10', 9)
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------



-- гюдюмхе 5

-- цпъгмне времхе ме дносяйюеряъ
--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе

--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	 
	begin tran 
	insert into PROGRESS values('ад', 1001, '2013-01-10', 9)
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------


-- гюдюмхе 6

-- цпъгмне времхе ме дносяйюеряъ
--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе ме дносяйюеряъ

--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	 
	begin tran 
	insert into PROGRESS values('ад', 1001, '2013-01-10', 9)
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- гюдюмхе 7

-- цпъгмне времхе ме дносяйюеряъ
--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе ме дносяйюеряъ

--- B --	 
	begin tran 
	delete from PROGRESS where SUBJECT = 'нюХо' and IDSTUDENT = 1001
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе ме дносяйюеряъ 

--- B --	 
	begin tran 
	insert into PROGRESS values('ад', 1001, '2013-01-10', 9)
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------


---- POD_MYBASE
use Pod_MyBase;


-- гюдюмхе 4

-- цпъгмне времхе

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	
	begin tran 
	insert into пейкюлш values(7, '102542', 4, '2025-02-21', '00:00:40', 'пЕЙКЮЛЮ ЙПЮЯНЙ')
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------


-- гюдюмхе 5

-- цпъгмне времхе ме дносяйюеряъ

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	
	begin tran 
	insert into пейкюлш values(7, '102542', 4, '2025-02-21', '00:00:40', 'пЕЙКЮЛЮ ЙПЮЯНЙ')
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- гюдюмхе 6

-- цпъгмне времхе ме дносяйюеряъ

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе ме дносяйюеряъ

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе

--- B --	
	begin tran 
	insert into пейкюлш values(7, '102542', 4, '2025-02-21', '00:00:40', 'пЕЙКЮЛЮ ЙПЮЯНЙ')
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------


-- гюдюмхе 7

-- цпъгмне времхе ме дносяйюеряъ

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback tran;

-- меонбрнпъчыееяъ времхе ме дносяйюеряъ

--- B --	
	begin tran 
	delete from пейкюлш where AdvertisingId = 2
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------

-- тюмрнлмне времхе ме дносяйюеряъ

--- B --	
	begin tran 
	insert into пейкюлш values(7, '102542', 4, '2025-02-21', '00:00:40', 'пЕЙКЮЛЮ ЙПЮЯНЙ')
	commit tran;
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------