use Pod_MyBase2;
insert into КОНТАКТНЫЕ_ЛИЦА(ContactPersonID, Telephone, ContactPersonFullName)
values(1, '+375292875940', 'Иванов Иван Иванович'),
	  (2, '+375442984754', 'Петров Роман Сергеевич'),
	  (3, '+375442748190', 'Семенов Валентин Петрович'),
	  (4, '+375295748499', 'Леньков Петр Степанович'),
	  (5, '+375295647391', 'Змитрович Григорий Анатольевич');
insert into ПЕРЕДАЧИ(ProgramID, ProgramName, Rating, MinuteConst)
values(1, 'Вечерние новости', 8.7, 200),
	  (2, 'Доброе утро, Беларусь!', 9.2, 250),
	  (3, 'Информационно-аналитическая программа', 5.6, 140),
	  (4, 'Наше Утро', 7.3, 179),
	  (5, 'Наши новости', 8.1, 187);
insert into ФИРМА_ЗАКАЗЧИК(CustomerCompanyID, CustomerCompanyName, BankDetails, ContactPersonID)
values(102542, 'СВИПТРЕЙД', '1029684920', 1),
	  (102543, 'REVLINE', '2058493881', 3),
	  (102544, 'MANNOL', '7548392032', 5),
	  (102545, 'CASTROL', '3456789233', 4),
	  (102546, 'VALVOLINE', '1234567823', 2);
insert into РЕКЛАМЫ(AdvertisingID, AdvertisingType, CustomerCompanyID, ProgramID, Date, Duration)
values(1, 'Реклама машинного масла', 102543, 1, '2025-02-15', '00:00:35'),
	  (2, 'Реклама двигателей', 102542, 5, '2025-02-20', '00:00:42'),
	  (3, 'Реклама тормозных жидкостей', 102542, 2, '2025-02-17', '00:00:28'),
	  (4, 'Реклама машинного масла', 102546, 5, '2025-02-26', '00:00:19'),
	  (5, 'Реклама антифризов', 102544, 4, '2025-02-19', '00:00:37');
