use ПРОДАЖИ2;
Insert into ТОВАРЫ(Наименование, Цена, Количество)
values('Castrol5w40D1LDPF', 29.55, 3),
	  ('CastrolD10W401LB4', 42, 1),
	  ('REVLINE10W401LULTRA', 23.09, 7),
	  ('REVLINEFORCEA5B5', 29.69, 10),
	  ('REVLINEULTRAFORCEC4', 35, 5);
Insert into ЗАКАЗЧИКИ(Наименование_фирмы, Адрес, Расчетный_счет)
values('CASTROL', 'г. Минск, улица Толбухина, 2, пом. 16', 'BY10OLMP18'),
	  ('LUKOIL', ' г. Минск, ул. Немига, 36', 'BY29OLMP45'),
	  ('REVLINE', 'Минский р-н, п.Опытный, ул.Центральная, д.1Б', 'BY90OLMP37'),
	  ('VALVOLINE', 'Ваупшасова 10, 2 эт, 115 ', 'BY37OLMP31'),
	  ('СВИПТРЕЙД', 'г. Орша,ул.Марата,107А', 'BY30OLMP30');
Insert into ЗАКАЗЫ(Номер_заказа, Наименование_товара, Цена_продажи, Количество, Дата_поставки, Заказчик)
values(1, 'REVLINEFORCEA5B5', 29.69, 2, '2025-02-11', 'СВИПТРЕЙД'),
	  (2, 'REVLINEULTRAFORCEC4', 35, 1, '2025-02-15', 'СВИПТРЕЙД'),
	  (3, 'CastrolD10W401LB4', 42, 1, '2025-02-13', 'СВИПТРЕЙД'),
	  (4, 'REVLINEFORCEA5B5', 29.9, 4, '2025-02-20', 'СВИПТРЕЙД'),
	  (5, 'REVLINEULTRAFORCEC4', 35, 3, '2025-02-20', 'СВИПТРЕЙД');